config.org
** Snippets

*** Yasnippet

YASnippet is a template system for Emacs.

https://github.com/joaotavora/yasnippet

#+begin_src emacs-lisp :lexical t
  (use-package yasnippet
    :config
    :init
    (yas-global-mode 1)
    :custom
    (yas-snippet-dirs '("~/.config/emacs/snippets")))
#+end_src

*** Yankpad

#+begin_src emacs-lisp :tangle no
  (use-package yankpad
    :ensure
    :init
    (setq yankpad-file "~/Library/Mobile Documents/com~apple~CloudDocs/org/yankpad.org")
    :bind
    (("<f6>" . #'yankpad-insert)))
#+end_src

* Settings

** Miscellaneous

UTF-8 as default.

#+begin_src emacs-lisp
  (set-language-environment "UTF-8")
  (set-default-coding-systems 'utf-8)
#+end_src

Use single space after sentences.

#+begin_src emacs-lisp
  (setq sentence-end-double-space nil)
#+end_src

Set default tab width to 10.

#+begin_src emacs-lisp
  (setq-default tab-width 10)
#+end_src

Use GNU =ls= to avoid "Listing directory failed but 'access-file' worked" error.

#+begin_src emacs-lisp
  (setq insert-directory-program "gls")
#+end_src

Kill message buffer on exit.

#+begin_src emacs-lisp
  (setq message-kill-buffer-on-exit t)
#+end_src

Use "y" and "n" in confirmation dialogues.

#+begin_src emacs-lisp
  (setf use-short-answers t)
#+end_src

Set Mac right command key as Emacs hyper key. I was using the fn key, but there were two problems. First, the fn key with A, F, H, E, C, N, and Q are used by the system. Second, on the new magic keyboard, the left control key is small and right by the fn key which I seem to always be reaching for. So, I remapped the fn key to control on the magic keyboard with Karabiner Elements.

#+begin_src emacs-lisp
  (setopt ns-right-command-modifier 'hyper)
  (setopt ns-right-alternate-modifier 'none)
#+end_src

Allow entering a command when the minibuffer is active.

#+begin_src emacs-lisp
  (setq enable-recursive-minibuffers t)
  (minibuffer-depth-indicate-mode 1)
#+end_src

Open links in default Mac browser.

#+begin_src emacs-lisp
  (setq browse-url-browser-function 'browse-url-default-macosx-browser)
  (setq browse-url-secondary-browser-function 'eww-browse-url)
#+end_src

World clock settings.

#+begin_src emacs-lisp
  (setq world-clock-list
	'(
	  ("America/Chicago" "Oklahoma City")
	  ("America/Los_Angeles" "Seattle")
	  ("Pacific/Honolulu" "Honolulu")
	  ("America/New_York" "New York")
	  ("Etc/UTC" "UTC")))

  (setq world-clock-time-format "%a, %d %b %R %Z")

  (setq calendar-location-name "Norman, OK"
	calendar-latitude 35.24371
	calendar-longitude -97.416797
	calendar-mark-holidays-flag t        ;colorize holidays in the calendar
	holiday-bahai-holidays nil           ;these religions have MANY holidays
	holiday-islamic-holidays nil         ;... that I don't get off
	holiday-hebrew-holidays nil         ;... that I don't get off
	)

  (global-set-key (kbd "<f8>") #'calendar)

#+end_src

Display line and column numbers in the modeline.

#+begin_src emacs-lisp
  (line-number-mode)
  (column-number-mode)
#+end_src

Wrap lines to fit frame size.

#+begin_src emacs-lisp
  (global-visual-line-mode 1)
#+end_src

Highlight current line, but only in the current window.

#+begin_src emacs-lisp
  (global-hl-line-mode)
  (setq hl-line-sticky-flag nil)
  (setq global-hl-line-sticky-flag nil)
#+end_src

Show 24 hour time in the modeline.

#+begin_src emacs-lisp
  (setq display-time-24hr-format t)
  (display-time-mode)
#+end_src

Silence warning bells.

#+begin_src emacs-lisp
  (setq ring-bell-function 'ignore)
#+end_src

Use MacOS SF Symbols

#+begin_src emacs-lisp :tangle no
  (when (memq system-type '(darwin))
    (set-fontset-font t nil "SF Pro Display" nil 'append))
#+end_src

Auto-insert and immediately highlight matching pairs of parentheses and quotes.

#+begin_src emacs-lisp
  (electric-pair-mode 1)
  (show-paren-mode)
  (setq show-paren-delay 0)
#+end_src

Save minibuffer history.

#+begin_src emacs-lisp
  (use-package savehist
    :config
    (savehist-mode 1))
#+end_src

Make M-x not offer options that don't apply to the current buffer.

#+begin_src emacs-lisp
(setq read-extended-command-predicate
      #'command-completion-default-include-p)
#+end_src

These are from [[https://emacsredux.com/blog/2026/04/07/stealing-from-the-best-emacs-configs/][Stealing from the Best Emacs Configs | Emacs Redux]]

Disable Bidirectional Text Scanning

#+begin_src emacs-lisp
(setq-default bidi-display-reordering 'left-to-right
	      bidi-paragraph-direction 'left-to-right)
(setq bidi-inhibit-bpa t)
#+end_src

Skip Fontification During Input

#+begin_src emacs-lisp
(setq redisplay-skip-fontification-on-input t)
#+end_src

Increase Process Output Buffer for LSP

#+begin_src emacs-lisp
(setq read-process-output-max (* 4 1024 1024)) ; 4MB
#+end_src

No Duplicates in the Kill Ring

#+begin_src emacs-lisp
(setq kill-do-not-save-duplicates t)
#+end_src

Persist the Kill Ring Across Sessions (Doom, Prot)

Most configs that use savehist-mode only persist search rings. But savehist can save any variable – including the kill ring. Add it and you get clipboard history that survives restarts:

#+begin_src emacs-lisp
(setq savehist-additional-variables
      '(search-ring regexp-search-ring kill-ring))
#+end_src

One thing to watch out for: the kill ring can accumulate text properties (fonts, overlays, etc.) that bloat the savehist file. Doom strips them before saving:

#+begin_src emacs-lisp
(add-hook 'savehist-save-hook
	  (lambda ()
	    (setq kill-ring
		  (mapcar #'substring-no-properties
			  (cl-remove-if-not #'stringp kill-ring)))))
#+end_src

Sane Syntax in re-builder

#+begin_src emacs-lisp
(setq reb-re-syntax 'string)
#+end_src

Prevent ffap from Pinging Hostnames (Centaur Emacs)

#+begin_src emacs-elisp
(setq ffap-machine-p-known 'reject)
#+end_src

Proportional Window Resizing

#+begin_src emacs-lisp
(setq window-combination-resize t)
#+end_src

Faster Mark Popping

#+begin_src emacs-lisp
(setq set-mark-command-repeat-pop t)
#+end_src

** Appearance

*** Themes

**** Modus Themes

#+begin_src emacs-lisp
  (use-package modus-themes
    :demand
    :bind
    (("<f9>" . #'modus-themes-toggle))
    :config
    ;; Add all your customizations prior to loading the themes
    (setq modus-themes-italic-constructs t
	  modus-themes-mixed-fonts t
	  modus-themes-variable-pitch-ui t
	  modus-themes-italic-constructs t
	  modus-themes-bold-constructs t)

    ;; Maybe define some palette overrides, such as by using our presets
    (setq modus-themes-common-palette-overrides
	  modus-themes-preset-overrides-faint)

    ;; Load the theme of your choice.
    (load-theme 'modus-operandi t))
#+end_src

#+begin_src emacs-lisp
  (defun rlr/customize-org-headings ()
    "Make Org headings larger."
    (set-face-attribute 'org-level-1 nil :height 1.3 :weight 'bold :inherit 'fixed-pitch)
    (set-face-attribute 'org-level-2 nil :height 1.2 :weight 'bold :inherit 'fixed-pitch)
    (set-face-attribute 'org-level-3 nil :height 1.1 :weight 'bold :inherit 'fixed-pitch)
    (set-face-attribute 'org-level-4 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)
    (set-face-attribute 'org-level-5 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)
    (set-face-attribute 'org-level-6 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)
    (set-face-attribute 'org-level-7 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)
    (set-face-attribute 'org-level-8 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)
    ;; Make the document title a bit bigger
    (set-face-attribute 'org-document-title nil :weight 'bold :height 1.5))

  (add-hook 'modus-themes-after-load-theme-hook #'rlr/customize-org-headings)
#+end_src

