config.org
** Files and Buffers

Increase number of recent files shown.

#+begin_src emacs-lisp
  (recentf-mode)
  (setopt recentf-max-menu-items 1000
	  recentf-max-saved-items 1000)
#+end_src

Open files to the last edited position.

#+begin_src emacs-lisp
  (setq save-place-file (expand-file-name "saveplaces" rr-cache-dir))
  (save-place-mode)
#+end_src

Give buffers uniquely numbered names.

#+begin_src emacs-lisp
  (require 'uniquify)
#+end_src

Update buffers when files are changed outside Emacs, but don't generate any messages.

#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
  (setq global-auto-revert-non-file-buffers t
	dired-auto-revert-buffer t
	auto-revert-verbose nil)
#+end_src

Don't ask for unnecessary confirmations in ibuffer.

#+begin_src emacs-lisp
  (setq ibuffer-expert t)
#+end_src

Auto-update ibuffer list.

#+begin_src emacs-lisp
  (add-hook 'ibuffer-mode-hook
	    #'(lambda ()
		(ibuffer-auto-mode 1)
		(ibuffer-switch-to-saved-filter-groups "home")))
#+end_src

Save minibuffer history in the cache directory.

#+begin_src emacs-lisp
  (setq savehist-file (expand-file-name "savehist" rr-cache-dir))
  (savehist-mode)
#+end_src

Don't ask for confirmation to edit a large file.

#+begin_src emacs-lisp
  (setq large-file-warning-threshold nil)
#+end_src

Mark date and time that files were saved.

#+begin_src emacs-lisp
  (add-hook 'before-save-hook 'time-stamp)
#+end_src

Don't ask for confirmation to kill processes when exiting Emacs. Credit to [[http://timothypratley.blogspot.com/2015/07/seven-specialty-emacs-settings-with-big.html][Timothy Pratley]].

#+begin_src emacs-lisp
  (defadvice save-buffers-kill-emacs (around no-query-kill-emacs activate)
    (cl-flet ((process-list ())) ad-do-it))
#+end_src

Don't ask for confirmation when killing process buffers.

#+begin_src emacs-lisp
  (setq kill-buffer-query-functions nil)
#+end_src

Don't display async shell command process buffers.

#+begin_src emacs-lisp
  (add-to-list 'display-buffer-alist
	       (cons "\\*Async Shell Command\\*.*" (cons #'display-buffer-no-window nil)))

#+end_src

If necessary, create directories for new files.

#+begin_src emacs-lisp
  (defun make-parent-directory ()
    "Make sure the directory of `buffer-file-name' exists."
    (make-directory (file-name-directory buffer-file-name) t))
  (add-hook 'find-file-not-found-functions #'make-parent-directory)
#+end_src

Kills all open buffers except scratch, dashboard, Mu4e, and messages. From https://github.com/ocodo/.emacs.d/blob/master/custom/handy-functions.el I also have it close other windows and tabs.

#+begin_src emacs-lisp
  (defun nuke-all-buffers ()
    "Kill all the open buffers except the current one.
	      Leave *scratch*, *dashboard* and *Messages* alone too."
    (interactive)
    (mapc
     (lambda (buffer)
       (unless (or
		(string= (buffer-name buffer) "*scratch*")
		(string= (buffer-name buffer) "*Org Agenda*")
		(string= (buffer-name buffer) "*Messages*")
		(string= (buffer-name buffer) "*mu4e-main*")
		)
	 (kill-buffer buffer)))
     (buffer-list))
    (delete-other-windows)
    (tab-bar-close-other-tabs)
    ;; (goto-dashboard)
    )
#+end_src

Kill other buffers and tabs.

#+begin_src emacs-lisp
  (defun rlr/kill-other-buffers ()
    (interactive)
    (crux-kill-other-buffers)
    (tab-bar-close-other-tabs))
#+end_src

Open the Emacs =init.org= file.

#+begin_src emacs-lisp
  (defun goto-emacs-init ()
    (interactive)
    (find-file (concat rr-emacs-dir "/init.org")))
#+end_src

Open the Fish function directory in Dired.

#+begin_src emacs-lisp
  (defun goto-shell-init ()
    (interactive)
    (find-file "~/.config/fish/functions/"))
#+end_src

Save the current (system) clipboard before replacing it with the Emacs’ text. https://github.com/dakrone/eos/blob/master/eos.org

#+begin_src emacs-lisp
  (setq save-interprogram-paste-before-kill t)
#+end_src

Set default input method to TeX

#+begin_src emacs-lisp
  (setq default-input-method 'TeX)
#+end_src

Overwrite selected text.

#+begin_src emacs-lisp
  (delete-selection-mode 1)
#+end_src

Add automatic time stamps to files, from [[https://olddeuteronomy.github.io/post/emacs-time-stamp/][The Emacs Cat]]. Put a time stamp somewhere in the first 10 lines of the file with this format:

- Elisp: =;; Time-stamp: <Last changed 2025-04-18 12:54:28 by rlridenour>=
- Org: =# Time-stamp: <Last changed 2025-04-22 14:40:44 by rlridenour>=

#+begin_src emacs-lisp
  ;; When there is a "Time-stamp: <>" string in the first 10 lines of the file,
  ;; Emacs will write time-stamp information there when saving the file.
  ;; (Borrowed from http://home.thep.lu.se/~karlf/emacs.html)
  (setq time-stamp-active t          ; Do enable time-stamps.
	time-stamp-line-limit 10     ; Check first 10 buffer lines for Time-stamp: <>
	time-stamp-format "Last changed %Y-%02m-%02d %02H:%02M:%02S by %u")
  (add-hook 'write-file-hooks 'time-stamp) ; Update when saving.
#+end_src

** Buffer Keybindings

Keybindings for files and buffers.

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x C-b") #'ibuffer)
  (global-set-key (kbd "s-o") #'find-file)
  (global-set-key (kbd "s-k") #'kill-current-buffer)
  (global-set-key (kbd "M-s-k") #'kill-buffer-and-window)
  (global-set-key (kbd "s-K") #'nuke-all-buffers)
#+end_src

** Windows

*** Ace Window

#+begin_src emacs-lisp
  (use-package ace-window
    :ensure
    :config
    (setq aw-dispatch-always t)
    :bind
    (("M-O" . #'ace-window)
     ("M-o" . #'rlr/quick-window-jump)))
#+end_src

#+begin_src emacs-lisp
  (defun rlr/quick-window-jump ()
    "If only one window, switch to previous buffer, otherwise call ace-window."
    (interactive)
    (let* ((window-list (window-list nil 'no-mini)))
      (if (< (length window-list) 3)
	  ;; If only one window, switch to previous buffer. If only two, jump directly to other window.
	  (if (one-window-p)
	      (switch-to-buffer nil)
	(other-window 1))
	(ace-window t))))
#+end_src

*** Window Functions

#+begin_src emacs-lisp
  (defun delete-window-balance ()
    "Delete window and rebalance the remaining ones."
    (interactive)
    (delete-window)
    (balance-windows))
#+end_src

#+begin_src emacs-lisp
  (defun split-window-below-focus ()
    "Split window horizontally and move focus to other window."
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))
#+end_src

#+begin_src emacs-lisp
  (defun split-window-right-focus ()
    "Split window vertically and move focus to other window."
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))
#+end_src

#+begin_src emacs-lisp
  (defun rlr/find-file-right ()
    "Split window vertically and select recent file."
    (interactive)
    (split-window-right-focus)
    (consult-buffer))
#+end_src

#+begin_src emacs-lisp
  (defun rlr/find-file-below ()
    "Split window horizontally and select recent file."
    (interactive)
    (split-window-below-focus)
    (consult-buffer))
#+end_src

#+begin_src emacs-lisp
  (defun toggle-window-split ()
    (interactive)
    (if (= (count-windows) 2)
	(let* ((this-win-buffer (window-buffer))
	       (next-win-buffer (window-buffer (next-window)))
	       (this-win-edges (window-edges (selected-window)))
	       (next-win-edges (window-edges (next-window)))
	       (this-win-2nd (not (and (<= (car this-win-edges)
					   (car next-win-edges))
				       (<= (cadr this-win-edges)
					   (cadr next-win-edges)))))
	       (splitter
		(if (= (car this-win-edges)
		       (car (window-edges (next-window))))
		    'split-window-horizontally
		  'split-window-vertically)))
	  (delete-other-windows)
	  (let ((first-win (selected-window)))
	    (funcall splitter)
	    (if this-win-2nd (other-window 1))
	    (set-window-buffer (selected-window) this-win-buffer)
	    (set-window-buffer (next-window) next-win-buffer)
	    (select-window first-win)
	    (if this-win-2nd (other-window 1))))))
#+end_src

#+begin_src emacs-lisp
  (defun toggle-frame-maximized-undecorated ()
    (interactive)
    (let* (
	   (frame (selected-frame))
	   (on? (and (frame-parameter frame 'undecorated) (eq (frame-parameter frame 'fullscreen) 'maximized)))
	   (geom (frame-monitor-attribute 'geometry))
	   (x (nth 0 geom))
	   (y (nth 1 geom))
	   (display-height (nth 3 geom))
	   (display-width (nth 2 geom))
	   (cut (if on? (if ns-auto-hide-menu-bar 26 50) (if ns-auto-hide-menu-bar 4 26))))
      (set-frame-position frame x y)
      (set-frame-parameter frame 'fullscreen-restore 'maximized)
      (set-frame-parameter nil 'fullscreen 'maximized)
      (set-frame-parameter frame 'undecorated (not on?))
      (set-frame-height frame (- display-height cut) nil t)
      (set-frame-width frame (- display-width 20) nil t)
      (set-frame-position frame x y)))
#+end_src

If more than one window, delete the window; if only one window, delete the tab; if only one tab, delete the frame.

#+begin_src emacs-lisp
  (defun rlr/delete-tab-or-frame ()
    "Delete current tab. If there is only one tab, then delete current frame."
    (interactive)
    (if
	(not (one-window-p))
	(delete-window)
      (condition-case nil
	  (tab-close)
	(error (delete-frame)))))
#+end_src

#+begin_src emacs-lisp
  (defun rlr/kill-buffer-delete-tab-or-frame ()
    "Kill current buffer and delete its tab. If there is only one tab, then delete current frame."
    (interactive)
    (kill-buffer)
    (if
	(not (one-window-p))
	(delete-window)
      (condition-case nil
	  (tab-close)
	(error (delete-frame)))))
#+end_src

