init.el

(global-set-key (kbd "s-0") #'delete-window)
(global-set-key (kbd "s-1") #'delete-other-windows)
(global-set-key (kbd "s-2") #'rlr/find-file-below)
(global-set-key (kbd "s-3") #'rlr/find-file-right)
(global-set-key (kbd "s-4") #'split-window-below-focus)
(global-set-key (kbd "s-5") #'split-window-right-focus)
(global-set-key (kbd "s-6") #'toggle-window-split)
(global-set-key (kbd "S-C-<left>") #'shrink-window-horizontally)
(global-set-key (kbd "S-C-<right>") #'enlarge-window-horizontally)
(global-set-key (kbd "S-C-<down>") #'shrink-window)
(global-set-key (kbd "S-C-<up>") #'enlarge-window)
(global-set-key (kbd "C-x w") #'delete-frame)
;; (global-set-key (kbd "M-o") #'crux-other-window-or-switch-buffer)
(global-set-key (kbd "s-\"") #'previous-window-any-frame)
(global-set-key (kbd "s-t") #'tab-new)
(global-set-key (kbd "s-T") #'rlr/find-file-new-tab)
(global-set-key (kbd "s-w") #'rlr/delete-tab-or-frame)
(global-set-key (kbd "s-W") #'rlr/kill-buffer-delete-tab-or-frame)

(defun insert-date-string ()
  "Insert current date yyyymmdd."
  (interactive)
  (insert (format-time-string "%Y%m%d")))

(defun insert-standard-date ()
  "Inserts standard date time string."
  (interactive)
  (insert (format-time-string "%B %e, %Y")))

(defun insert-blog-date ()
  (interactive)
  (insert (format-time-string "%Y-%m-%d-")))

(defun rr/wrap-at-sentences ()
  "Fills the current paragraph, but starts each sentence on a new line."
  (interactive)
  (save-excursion
    ;; Select the entire paragraph.
    (mark-paragraph)
    ;; Move to the start of the paragraph.
    (goto-char (region-beginning))
    ;; Record the location of the end of the paragraph.
    (setq end-of-paragraph (region-end))
    ;; Wrap lines with hard newlines.
    (let ((use-hard-newlines 't))
	;; Loop over each sentence in the paragraph.
	(while (< (point) end-of-paragraph)
	  ;; Move to end of sentence.
	  (forward-sentence)
	  ;; Delete spaces after sentence.
	  (just-one-space)
	  ;; Delete preceding space.
	  (delete-char -1)
	  ;; Insert a newline before the next sentence.
	  (insert "\n")
	  ))))

(defun dos2unix ()
  "Replace DOS eolns CR LF with Unix eolns CR"
  (interactive)
  (goto-char (point-min))
  (while (search-forward (string ?\C-m) nil t) (replace-match "\n")))

(defun strip-url-tracking (url)
  "Strip common tracking parameters from URL."
  (let* ((tracking-params '("utm_source" "utm_medium" "utm_campaign"
			      "utm_term" "utm_content" "utm_id"
			      "fbclid" "gclid" "gad_source"
			      "mc_cid" "mc_eid" "ref" "source"
			      "_ga" "_gl" "msclkid" "twclid"))
	   (parsed (url-generic-parse-url url))
	   (query (url-filename parsed)))
    (if (string-match "\\?" query)
	  (let* ((path (substring query 0 (match-beginning 0)))
		 (qs (substring query (match-end 0)))
		 (params (split-string qs "&"))
		 (clean (seq-filter
			 (lambda (p)
			   (not (member (car (split-string p "="))
					tracking-params)))
			 params))
		 (new-qs (string-join clean "&"))
		 (new-file (if (string-empty-p new-qs)
			       path
			     (concat path "?" new-qs))))
	    (setf (url-filename parsed) new-file)
	    (url-recreate-url parsed))
	url)))

(defun strip-url-tracking-at-point ()
  "Strip tracking params from URL at point or read from minibuffer."
  (interactive)
  (let* ((url (or (thing-at-point 'url t)
		    (read-string "URL: ")))
	   (clean (strip-url-tracking url)))
    (message "Clean URL: %s" clean)
    (kill-new clean)))

(defun strip-url-tracking-region (beg end)
  "Strip tracking params from all URLs in region."
  (interactive "r")
  (let ((text (buffer-substring-no-properties beg end)))
    (replace-regexp-in-region
     "https?://[^\s\n\"]+"
     (lambda (url) (strip-url-tracking url))
     beg end)))

(defun delete-extra-blank-lines ()
  (interactive)
  (save-excursion)
  (beginning-of-buffer)
  (replace-regexp "^\n\n+" "\n"))

(defun rr/insert-unicode (unicode-name)
  "Same as C-x 8 enter UNICODE-NAME."
  (insert-char (gethash unicode-name (ucs-names))))

(defun push-mark-no-activate ()
    "Pushes `point' to `mark-ring' and does not activate the region
     Equivalent to \\[set-mark-command] when \\[transient-mark-mode] is disabled"
    (interactive)
    (push-mark (point) t nil)
    (message "Pushed mark to ring"))

;;  (general-define-key "C-`" #'push-mark-no-activate) ;
;;  (general-define-key "M-`" #'consult-mark)

; Don't break out a separate frame for ediff
(setq ediff-window-setup-function 'ediff-setup-windows-plain)

				; Horizontal splitting really ought to be the default, honestly.
(setq ediff-split-window-function 'split-window-horizontally)

(use-package crux
  :bind
  (("s-p" . #'crux-create-scratch-buffer)
   ("s-j" . #'crux-top-join-line)
   ("<S-return>" . #'crux-smart-open-line)
   ("<C-S-return>" . #'crux-smart-open-line-above)
   ("<escape>" . #'crux-keyboard-quit-dwim)))

(use-package dired
  :ensure nil
  :bind
  (:map dired-mode-map
	  ("M-<RET>" . #'crux-open-with)))

(define-key (current-global-map) [remap keyboard-quit] #'crux-keyboard-quit-dwim)

(use-package evil-nerd-commenter
  :bind
  ("M-;" . #'evilnc-comment-or-uncomment-lines))

(use-package magit
  :after transient
  :bind ("C-x g" . magit-status)
  :custom
  (magit-git-executable "/opt/homebrew/bin/git")
  :init
  (setq magit-process-connection-type nil)
  :config
  (setq magit-refresh-verbose t)
  )

(use-package jinx
  :init
  (setenv "PKG_CONFIG_PATH" (concat "/opt/homebrew/opt/glib/lib/pkgconfig/:" (getenv "PKG_CONFIG_PATH")))
  :config
  (setq ispell-silently-savep t)
  :hook (emacs-startup . global-jinx-mode)
  :bind
  (([remap ispell-word] . #'jinx-correct)
   ("<f7>" . #'jinx-correct)
   ("S-<f7>" . #'jinx-correct-all)))

(global-set-key (kbd "<s-up>") #'beginning-of-buffer)
(global-set-key (kbd "<s-down>")  #'end-of-buffer)
(global-set-key (kbd "<s-right>") #'end-of-visual-line)
(global-set-key (kbd "<s-left>") #'beginning-of-visual-line)
(global-set-key (kbd "<M-down>") #'forward-paragraph)
(global-set-key (kbd "<M-up>") #'backward-paragraph)
(global-set-key (kbd "M-u") #'upcase-dwim)
(global-set-key (kbd "M-l") #'downcase-dwim)
(global-set-key (kbd "M-c") #'capitalize-dwim)
(global-set-key (kbd "RET") #'newline-and-indent)
(global-set-key (kbd "M-/") #'hippie-expand)
(global-set-key (kbd "<s-backspace>") #'kill-whole-line)
(global-set-key (kbd "<C-d d>") #'insert-standard-date)
(global-set-key (kbd "M-q") #'reformat-paragraph)
(global-set-key (kbd "M-#") #'dictionary-lookup-definition)

(use-package org
  :ensure nil
  :init
