init.el
  ;; (setq org-directory "/Users/rlridenour/Library/Mobile Documents/com~apple~CloudDocs/org/")
  (setq org-directory "/Users/rlridenour/Library/Mobile Documents/com~apple~CloudDocs/org/")
  :config
  (setq org-modules '(org-id org-attach)) ;; Recommended by Boris
  (setq org-list-allow-alphabetical t)
  (setq org-highlight-latex-and-related '(latex script entities))
  (setq org-startup-indented nil)
  (setq org-adapt-indentation nil)
  (setq org-hide-leading-stars nil)
  (setq org-hide-emphasis-markers t)
  (setq org-list-indent-offset 2)
  (setq org-use-speed-commands t)

  (setq org-deadline-warning-days 1)

  ;; Hide drawers
  (setopt org-cycle-hide-drawer-startup t)
  (setopt org-startup-folded 'nofold)

  (set-face-attribute 'org-level-1 nil :height 1.3 :weight 'bold :inherit 'fixed-pitch)
  (set-face-attribute 'org-level-2 nil :height 1.2 :weight 'bold :inherit 'fixed-pitch)
  (set-face-attribute 'org-level-3 nil :height 1.1 :weight 'bold :inherit 'fixed-pitch)
  (set-face-attribute 'org-level-4 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)
  (set-face-attribute 'org-level-5 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)
  (set-face-attribute 'org-level-6 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)
  (set-face-attribute 'org-level-7 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)
  (set-face-attribute 'org-level-8 nil :height 1.0 :weight 'bold :inherit 'fixed-pitch)

  ;; Make the document title a bit bigger
  (set-face-attribute 'org-document-title nil :weight 'bold :height 1.5)

  ;; Make LaTeX previews larger.
  (plist-put org-format-latex-options :scale 1.5)

  ;; (setq org-support-shift-select t)
  (setq org-special-ctrl-a/e t)
  ;; (setq org-footnote-section nil)
  (setq org-html-validation-link nil)
  (setq org-time-stamp-rounding-minutes '(0 15))
  (setq org-log-done t)
  (setq org-todo-keyword-faces
	  '(("DONE" . "green4") ("TODO" . org-warning)))
  (setq org-agenda-files '("/Users/rlridenour/Library/Mobile Documents/iCloud~com~appsonthemove~beorg/Documents/org/"))
  (setq org-agenda-start-on-weekday nil)
  (setq org-agenda-window-setup 'current-window)
  (setq org-link-frame-setup
	  '((vm . vm-visit-folder-other-frame)
	(vm-imap . vm-visit-imap-folder-other-frame)
	(gnus . org-gnus-no-new-news)
	(file . find-file)
	(wl . wl-other-frame)))
  (require 'org-tempo)
  ;; Open directory links in Dired.
  (add-to-list 'org-file-apps '(directory . emacs)))

(setq org-export-backends '(ascii html icalendar latex odt md))
(require `ox-md)

(add-hook 'org-mode-hook #'variable-pitch-mode)
(add-hook 'markdown-mode-hook #'variable-pitch-mode)
(global-set-key (kbd "C-M-S-s-v") #'variable-pitch-mode)

(defun csm/org-word-count ()
  "Count words in region/buffer, estimate pages, and reading time.
Excludes lines beginning with * or #. Prints result in echo area."
  (interactive)
  (let* ((start (if (use-region-p) (region-beginning) (point-min)))
	   (end (if (use-region-p) (region-end) (point-max)))
	   (word-count
	    (save-excursion
	      (goto-char start)
	      (let ((count 0)
		    (inhibit-field-text-motion t))
		(while (< (point) end)
		  (beginning-of-line)
		  (unless (looking-at-p "^[*#<]")
		    (let ((line-end (line-end-position)))
		      (while (re-search-forward "\\w+\\W*" line-end t)
			(setq count (1+ count)))))
		  (forward-line 1))
		count)))
	   (words-per-page 400)
	   (reading-speed 215)
	   (page-count (/ (+ word-count words-per-page -1) words-per-page))
	   (reading-time (/ (+ word-count reading-speed -1) reading-speed)))
    (message "%d words, ~%d pages, ~%d min read"
	       word-count page-count reading-time)))

(defun cc/yank-markdown-as-org ()
  "Yank Markdown text as Org.

This command will convert Markdown text in the top of the `kill-ring'
and convert it to Org using the pandoc utility."
  (interactive)
  (save-excursion
    (with-temp-buffer
	(yank)
	(shell-command-on-region
	 (point-min) (point-max)
	 "pandoc -f markdown -t org --wrap=preserve" t t)
	(kill-region (point-min) (point-max)))
    (yank)))

(defun mb/org-copy-region-as-markdown ()
  "Copy the region (in Org) to the system clipboard as Markdown."
  (interactive)
  (if (use-region-p)
	(let* ((region
		(buffer-substring-no-properties
		 (region-beginning)
		 (region-end)))
	       (markdown
		(org-export-string-as region 'md t '(:with-toc nil))))
	  (gui-set-selection 'CLIPBOARD markdown))))

(use-package org-appear
  :after org
  :commands (org-appear-mode)
  ;; :hook     (org-mode . org-appear-mode)
  :config
  (setq org-hide-emphasis-markers t)  ; Must be activated for org-appear to work
  (setq org-appear-autoemphasis   t   ; Show bold, italics, verbatim, etc.
	  org-appear-autolinks      t   ; Show links
	  org-appear-autosubmarkers t)) ; Show sub and superscripts

(use-package org-modern
  :after org
  :config
  (add-hook 'org-agenda-finalize-hook #'org-modern-agenda)
  )
