config.org
** Org Agenda

#+begin_src emacs-lisp
  (use-package org-super-agenda
    :after org
    :config
    (setq org-agenda-skip-scheduled-if-done t
	  org-agenda-skip-deadline-if-done t
	  setq org-agenda-skip-scheduled-if-deadline-is-shown t
	  org-agenda-skip-deadline-prewarning-if-scheduled t
	  org-agenda-include-deadlines t
	  org-deadline-warning-days 1
	  org-agenda-block-separator nil
	  org-agenda-compact-blocks t
	  org-agenda-start-day nil ;; i.e. today
	  org-agenda-span 1
	  org-agenda-window-setup "current-window"
	  org-agenda-include-diary nil
	  org-agenda-start-on-weekday nil)
    (setq org-agenda-time-grid
	  '((daily today remove-match)
	()
	"......"
	""))
    (org-super-agenda-mode))
#+end_src

#+begin_src emacs-lisp
  (setq org-agenda-custom-commands
	'(("d" "Agenda for today" agenda ""
	   ((org-agenda-overriding-header "Today's agenda")
	    (org-agenda-span 'day)
	    ))))
#+end_src

#+begin_src emacs-lisp
  (defun today-agenda ()
    "Display today's agenda"
    (interactive)
    (org-agenda nil "d")
    )
  (today-agenda)
#+end_src

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (add-to-list
     'org-agenda-custom-commands
     `("c" "Today - Full View"
       ((agenda ""
		((org-agenda-entry-types '(:timestamp :sexp))
		 (org-agenda-overriding-header
		  (concat "CALENDAR Today "
			  (format-time-string "%a %d" (current-time))))
		 (org-agenda-span 'day)))
	(tags-todo "LEVEL=1+inbox"
		   ((org-agenda-overriding-header "INBOX (Unscheduled)")))
	(tags-todo "DEADLINE<\"<+1d>\"+DEADLINE>\"<-1d>\""
		   ((org-agenda-overriding-header "DUE TODAY")
		    (org-agenda-skip-function
		     '(org-agenda-skip-entry-if 'notdeadline))
		    (org-agenda-sorting-strategy '(priority-down))))
	(tags-todo "DEADLINE<\"<today>\""
		   ((org-agenda-overriding-header "OVERDUE")
		    (org-agenda-skip-function
		     '(org-agenda-skip-entry-if 'notdeadline))
		    (org-agenda-sorting-strategy '(priority-down))))
	(agenda ""
		((org-agenda-entry-types '(:scheduled))
		 (org-agenda-overriding-header "SCHEDULED")
		 (org-agenda-skip-function
		  '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-sorting-strategy
		  '(priority-down time-down))
		 (org-agenda-span 'day)
		 (org-agenda-start-on-weekday nil)))
	(todo "DONE"
	      ((org-agenda-overriding-header "COMPLETED"))))
       ((org-agenda-format-date "")
	(org-agenda-start-with-clockreport-mode nil))) t))
#+end_src

This opens the daily agenda and deletes all other windows.

#+begin_src emacs-lisp
  (defun agenda-home ()
    (interactive)
    (org-agenda-list 1)
    (delete-other-windows))
#+end_src

Set the initial frame. This opens the daily agenda on start-up.

#+begin_src emacs-lisp
  (add-hook 'server-after-make-frame-hook #'agenda-home)
#+end_src

Refresh the agenda, but suppress the error message when the agenda is not visible.

#+begin_src emacs-lisp
  (defun refresh-agenda-periodic-function ()
    "Recompute the Org Agenda buffer(s) periodically."
    (ignore-errors
      (when (get-buffer "*Org Agenda*")
	(with-selected-window (get-buffer-window "*Org Agenda*")
	  (org-agenda-redo-all)))))

  ;; Refresh agenda every 600 seconds (10 minutes)
  (run-with-timer 60 60 'refresh-agenda-periodic-function)

#+end_src

Shorten the current time string.

#+begin_src emacs-lisp
(setq org-agenda-current-time-string "now - - - - - - -")
#+end_src

Make the current time more visible.

#+begin_src emacs-lisp
(custom-set-faces
 '(org-agenda-current-time ((t (:foreground "red3")))))
#+end_src

#+begin_src emacs-lisp
  (global-set-key (kbd "s-d") #'agenda-home)
#+end_src

#+begin_src emacs-lisp
  (defun rlr/agenda-links ()
    (end-of-buffer)
    (insert-file-contents "/Users/rlridenour/Library/Mobile Documents/com~apple~CloudDocs/org/agenda-links.org")
    (while (org-activate-links (point-max))
      (goto-char (match-end 0)))
    ;; (end-of-buffer)
    ;; (insert (concat "\n\n" (get-votd)))
    (beginning-of-buffer))

  (add-hook 'org-agenda-finalize-hook #'rlr/agenda-links)
#+end_src

Open links with the return key.

#+begin_src emacs-lisp
  (setq org-return-follows-link t)
#+end_src

Use space key to show link hints.

#+begin_src emacs-lisp :tangle no
  (general-define-key
   :keymaps 'org-agenda-mode-map
   "<SPC>" #'link-hint-open-link
   "," #'link-hint-open-link)
#+end_src

Set agenda links as safe.

#+begin_src emacs-lisp
  (setopt org-link-elisp-skip-confirm-regexp "rlr.*")
#+end_src

Use Emacs appointment system for notifications.

#+begin_src emacs-lisp
  (setq appt-time-msg-list nil)    ;; clear existing appt list
  ;; (setq appt-message-warning-time '15)  ;; send first warning 15 minutes before appointment
  (org-agenda-to-appt) ;; generate the appt list from org agenda files on emacs launch
  (run-at-time "24:01" 3600 'org-agenda-to-appt) ;; update appt list hourly
  (add-hook 'org-finalize-agenda-hook 'org-agenda-to-appt) ;; update appt list on agenda view
#+end_src

** Org Contrib

#+begin_src emacs-lisp
  (use-package org-contrib
:after org
    :config
    (require 'ox-extra)
    (ox-extras-activate '(ignore-headlines))
    (require 'org-tempo)
    ;; (require 'ox-rss)
)
#+end_src

** Org Autolist

#+begin_src emacs-lisp
(use-package org-autolist
  :hook (org-mode . org-autolist-mode))
#+end_src

** Org Bulletproof

#+begin_src emacs-lisp
(use-package org-bulletproof)
#+end_src

** Org Toggle Emphasis

[[https://gist.github.com/jdtsmith/55e6a660dd4c0779a600ac81bf9bfc23][org-toggle-emphasis: easily toggle emphasis markers: =~*/_+]]

#+begin_src emacs-lisp
  (defun my/org-toggle-emphasis (type)
    "Toggle org emphasis TYPE (a character) at point."
    (cl-labels ((in-emph (re)
		  "See if in org emphasis given by RE."
		  (and (org-in-regexp re 2)
		       (>= (point) (match-beginning 3))
		       (<= (point) (match-end 4))))
		(de-emphasize ()
		  "Remove most recently matched org emphasis markers."
		  (save-excursion
		    (replace-match "" nil nil nil 3)
		    (delete-region (match-end 4) (1+ (match-end 4))))))
      (let* ((res (vector org-emph-re org-verbatim-re))
	     (idx (cl-case type (?/ 0) (?* 0) (?_ 0) (?+ 0) (?= 1) (?~ 1)))
	     (re (aref res idx))
	     (other-re (aref res (- 1 idx)))
	     (type-re (string-replace (if (= idx 1) "=~" "*/_+")
				      (char-to-string type) re))
	     add-bounds offset is-word)
	(save-match-data
	  (if (region-active-p)
	      (if (in-emph type-re) (de-emphasize) (org-emphasize type))
	    (if (eq (char-before) type) (backward-char))
	    (if (in-emph type-re)       ;nothing marked, in emph text?
		(de-emphasize)
	      (setq add-bounds          ; check other flavors
		    (if (or (in-emph re) (in-emph other-re))
			(cons (match-beginning 4) (match-end 4))
		      (setq is-word t)
		      (bounds-of-thing-at-point 'symbol))))
	    (if add-bounds
		(let ((off (- (point) (car add-bounds)))
		      (at-end (= (point) (cdr add-bounds))))
		  (set-mark (car add-bounds))
		  (goto-char (cdr add-bounds))
		  (org-emphasize type)  ;deletes marked region!
		  (unless is-word       ; delete extra spaces
		    (goto-char (car add-bounds))
		    (when (eq (char-after) ?\s) (delete-char 1))
		    (goto-char (+ 2 (cdr add-bounds)))
		    (when (eq (char-after) ?\s) (delete-char 1)))
		  (goto-char (+ (car add-bounds) off
				(cond ((= off 0) 0) (at-end 2) (t 1)))))
	      (if is-word (org-emphasize type))))))))
#+end_src

#+begin_src emacs-lisp :tangle no
  (general-define-key
   :keymaps 'org-mode-map
   "s-<right>" #'org-end-of-line
   "s-<left>" #'org-beginning-of-line
   "s-i" (lambda () (interactive) (my/org-toggle-emphasis ?/))
   "s-b" (lambda () (interactive) (my/org-toggle-emphasis ?*))
   "C-c e e" (lambda () (interactive) (my/org-toggle-emphasis ?~))
   "C-c e =" (lambda () (interactive) (my/org-toggle-emphasis ?=))
   "C-c e _" (lambda () (interactive) (my/org-toggle-emphasis ?_))
   "C-c e +" (lambda () (interactive) (my/org-toggle-emphasis ?+)))
#+end_src

** Org Upcoming Modeline

[[https://github.com/unhammer/org-upcoming-modeline][unhammer/org-upcoming-modeline: 📅 Show upcoming org event in modeline]]

#+begin_src emacs-lisp
(use-package org-upcoming-modeline
  :after org                               ; if you don't want it to start until org has been loaded
  :config
  (org-upcoming-modeline-mode))
#+end_src

** Org People

#+begin_src emacs-lisp
(use-package org-people
  :after org)
#+end_src

** Org Mac Link

#+begin_src emacs-lisp
  (use-package org-mac-link
:defer 1)
#+end_src

