config.org
** Org Web Tools

#+begin_src emacs-lisp
  (use-package org-web-tools
    :defer 10)
  #+end_src

#+begin_src emacs-lisp
  (defun rlr/save-web-page-as-org-file ()
    (interactive)
    (org-mac-link-safari-get-frontmost-url)
    (setq rlr-org-link (current-kill 0 t))
    (setq rlr-org-link (s-chop-left 2 rlr-org-link))
    (setq rlr-org-link (s-chop-right 2 rlr-org-link))
    (setq rlr-org-link (s-split "\\]\\[" rlr-org-link))
    (setq rlr-org-url (pop rlr-org-link))
    (setq rlr-org-title (pop rlr-org-link))
    (setq rlr-org-title (s-replace-all '(("." . "") (":" . "") ("/" . "")) rlr-org-title))
    (setq rlr-org-filename (s-dashed-words rlr-org-title))
    (org-web-tools-read-url-as-org rlr-org-url)
    (write-file (concat "~/icloud/web-saves/" rlr-org-title ".org")))
#+end_src

