config.org
** Teaching

Set initial filename variable.

#+begin_src emacs-lisp
  (defvar rlrt-filename)
#+end_src

Functions for creating handout, syllabus, and lecture files.

Convert title to filename string. Remove punctuation, one or two-letter words, and "the".

#+begin_src emacs-lisp
  (defun rlrt-make-filename (string)
    (s-downcase  (s-join "-" (s-split " " (replace-regexp-in-string "\\bthe \\b\\|\\band \\b\\|\\b[a-z]\\b \\|\\b[a-z][a-z]\\b \\|[[:punct:]]" "" string)))))
#+end_src

#+begin_src emacs-lisp
  (defun rlrt-new-handout (rlrt-title)
    (interactive "sTitle: ")

    ;; Make filename
    (setq rlrt-filename (rlrt-make-filename rlrt-title))

    ;; Create directory
    (make-directory rlrt-filename)

    ;; Create main org file
    (find-file (s-concat rlrt-filename "/" rlrt-filename "-handout.org"))
    (insert (s-concat "#+TITLE: " rlrt-title) ?\n"#+AUTHOR: Dr. Randy Ridenour" ?\n "#+DATE: "(format-time-string "%B %e, %Y") ?\n)
    (insert-file-contents "~/.config/emacs/teaching-templates/handout/handout.org")
    (goto-char (point-max))
    (save-buffer))
#+end_src

Create a syllabus in the currently visited directory.

#+begin_src emacs-lisp
  (defun rlrt-new-syllabus (rlrt-title)
    (interactive "sTitle: ")

    ;; Make filename
    (setq rlrt-filename (rlrt-make-filename rlrt-title))

    ;; Create directory
    (make-directory rlrt-filename)

    ;; Create main org file
    (find-file (s-concat rlrt-filename "/" rlrt-filename "-syllabus.org"))
    (insert-file-contents "~/.config/emacs/teaching-templates/syllabus/syllabus.org")
    (goto-char (point-max))
    (insert (s-concat "#+include: \"" rlrt-filename "-data.org\" :minlevel 1"))
    (save-buffer)
    (kill-buffer)

    ;; Create Canvas file
    (find-file (s-concat rlrt-filename "/canvas.org"))
    (insert-file-contents "~/.config/emacs/teaching-templates/syllabus/canvas.org")
    (save-buffer)
    (kill-buffer)

    ;; Create data file
    (find-file (s-concat rlrt-filename "/" rlrt-filename "-data.org")))
#+end_src

Create lecture slides and notes in the currently visited directory.

#+begin_src emacs-lisp
  (defun rlrt-new-lecture (rlrt-title)
    (interactive "sTitle: ")

    ;; Make filename
    (setq rlrt-filename (rlrt-make-filename rlrt-title))

    ;; Create directory
    (make-directory rlrt-filename)
#+end_src

Create LaTeX Beamer org file

#+begin_src emacs-lisp
  (find-file (s-concat rlrt-filename "/" rlrt-filename "-slides.org"))
  (insert-file-contents "~/.config/emacs/teaching-templates/lecture/slides.org")
  (goto-char (point-max))
  (insert (s-concat "#+include: \"" rlrt-filename "-data.org\" :minlevel 1"))
  (save-buffer)
  (kill-buffer)
#+end_src

Create notes org file

#+begin_src emacs-lisp
  (find-file (s-concat rlrt-filename "/" rlrt-filename "-notes.org"))
  (insert-file-contents "~/.config/emacs/teaching-templates/lecture/notes.org")
  (goto-char (point-max))
  (insert (s-concat "#+include: \"" rlrt-filename "-data.org\" :minlevel 1"))
  (save-buffer)
  (kill-buffer)
#+end_src

Create Canvas file
#+begin_src emacs-lisp
  (find-file (s-concat rlrt-filename "/canvas.org"))
  (insert-file-contents "~/.config/emacs/teaching-templates/lecture/canvas.org")
  (goto-char (point-max))
  (save-buffer)
  (kill-buffer)
#+end_src

Create data file

#+begin_src emacs-lisp
  (find-file (s-concat rlrt-filename "/" rlrt-filename "-data.org"))
  (insert (s-concat "#+TITLE: " rlrt-title) ?\n)
  (yas-expand-snippet (yas-lookup-snippet "beamer-data")))
#+end_src

Compile the files.

#+begin_src emacs-lisp
  (defun make-slides ()
    (async-shell-command-no-window "mkslides"))
#+end_src

#+begin_src emacs-lisp
  (defun make-notes ()
    (async-shell-command-no-window "mknotes"))
#+end_src

Compile lecture slides.

#+begin_src emacs-lisp
  (defun lecture-slides ()
    "publish org data file as beamer slides"
    (interactive)
    (save-buffer)
    (find-file "*-slides.org" t)
    (org-beamer-export-to-latex)
    (kill-buffer)
    (make-slides)
    (find-file "*-data.org" t))
#+end_src

#+begin_src emacs-lisp
  (defun rlr/create-frametitle ()
    "Convert title to frametitle."
    (interactive)
    (goto-char 1)
    (while (ignore-errors
	     (re-search-forward "begin{frame}.*]"))
      (insert "\n \\frametitle")))
#+end_src

Compile lecture notes.

#+begin_src emacs-lisp
  (defun lecture-notes ()
    "publish org data file as beamer notes"
    (interactive)
    (save-buffer)
    (find-file "*-notes.org" t)
    (org-beamer-export-to-latex)
    (kill-buffer)
    (find-file "*-notes.tex" t)
    (rlr/create-frametitle)
    (save-buffer)
    (kill-buffer)
    (make-notes)
    (find-file "*-data.org" t))
#+end_src

Copy HTML for Canvas pages

#+begin_src emacs-lisp
  (defun canvas-copy ()
    "Copy html for canvas pages"
    (interactive)
    (save-buffer)
    (org-html-export-to-html)
    (shell-command "canvas"))
#+end_src

Compile Canvas HTML notes.

#+begin_src emacs-lisp
  (defun canvas-notes ()
    "Copy HTML slide notes for Canvas"
    (interactive)
    (save-buffer)
    (shell-command "canvas-notes")
    (find-file "canvas.org")
    (canvas-copy)
    (kill-buffer)
    (delete-file "canvas-data.org"))
#+end_src

Compile handout

#+begin_src emacs-lisp
  (defun make-handout ()
    "publish org data file as LaTeX handout and Canvas HTML"
    (interactive)
    (save-buffer)
    ;; (find-file "*-handout.org" t)
    (rlr/org-mklua)
    ;; (kill-buffer)
    ;; (shell-command "canvas-notes")
    ;; (find-file "canvas.org" t)
    (org-html-export-to-html)
    (shell-command "canvas-handout"))
#+end_src

#+begin_src emacs-lisp
  (defun make-html ()
    (interactive)
    (save-buffer)
    (org-html-export-to-html)
    (shell-command "canvas-handout"))
#+end_src

Compile syllabus.

#+begin_src emacs-lisp
  (defun make-syllabus ()
    "publish org data file as LaTeX syllabus and Canvas HTML"
    (interactive)
    (save-buffer)
    (find-file "*-syllabus.org" t)
    (rlr/org-mklua)
    (kill-buffer)
    (shell-command "canvas-notes")
    (find-file "canvas.org" t)
    (org-html-export-to-html)
    (shell-command "canvas")
    (kill-buffer)
    (delete-file "canvas-data.org")
    (find-file "*-data.org" t))
#+end_src

Functions for adding arguments in standard form to Org documents.

#+begin_src emacs-lisp
  (defun  create-args ()
    (interactive)
    (kill-ring-save (region-beginning) (region-end))
    (exchange-point-and-mark)
    (yas-expand-snippet (yas-lookup-snippet "arg-wrap-tex"))
    (previous-line)
    ;; (previous-line)
    (org-beginning-of-line)
    (forward-word)
    (forward-char)
    (forward-char)
    (insert "\\underline{")
    (org-end-of-line)
    (insert "}")
    (next-line)
    (org-beginning-of-line)
    (forward-word)
    (insert "[\\phantom{\\(\\therefore\\)}]")
    (next-line)
    (next-line)
    (org-return)
    (org-return)
    (org-yank)
    (exchange-point-and-mark)
    (yas-expand-snippet (yas-lookup-snippet "arg-wrap-html")))
#+end_src

#+begin_src emacs-lisp
  (defun  create-tex-arg ()
    (interactive)
    (yas-expand-snippet (yas-lookup-snippet "arg-wrap-tex"))
    (previous-line)
    (previous-line)
    (forward-word)
    (forward-char)
    (forward-char)
    (insert "\\underline{")
    (org-end-of-line)
    (insert "}")
    (next-line)
    (org-beginning-of-line)
    (forward-word)
    (insert "[\\phantom{\\(\\therefore\\)}]")
    (next-line)
    (next-line)
    (org-return)
    (org-return))
#+end_src

Copy slide notes to handout notes.

#+begin_src emacs-lisp
  (defun duplicate-slide-note ()
    (interactive)
    (search-backward ":END:")
    (next-line)
    (kill-ring-save (point)
		    (progn
		      (search-forward "** ")
		      (beginning-of-line)
		      (point))
		    )
    (yas-expand-snippet (yas-lookup-snippet "beamer article notes"))
    (yank))

  (defun duplicate-all-slide-notes ()
    (interactive)
    (save-excursion
      (end-of-buffer)
      (newline)
      (newline)
      ;; Need a blank slide at the end to convert the last note.
      (insert "** ")
      (beginning-of-buffer)
      (while (ignore-errors
	       (search-forward ":BEAMER_ENV: note"))
	(next-line)
	(next-line)
	(kill-ring-save (point)
			(progn
			  (search-forward "** ")
			  (beginning-of-line)
			  (point))
			)
	(yas-expand-snippet (yas-lookup-snippet "beamer article notes"))
	(yank))
      ;; Delete the blank slide that was added earlier.
      (end-of-buffer)
      (search-backward "**")
      (kill-line)
      )
    (save-buffer))
#+end_src

Create new article.

#+begin_src emacs-lisp
  (defun rlrt-new-article (rlrt-title)
    (interactive "sTitle: ")

    ;; Make filename
    (setq rlrt-filename (rlrt-make-filename rlrt-title))

    ;; Create directory
    (make-directory rlrt-filename)

    (find-file (s-concat rlrt-filename "/" rlrt-filename ".org"))
    (insert (s-concat "#+TITLE: " rlrt-title) ?\n)
    (yas-expand-snippet (yas-lookup-snippet "rlrt-lua-article")))
#+end_src

Function for converting Org mode files to QTI file for importing into Canvas using https://www.nyit.edu/its/canvas_exam_converter

#+begin_src emacs-lisp
  (defun convert-qti-nyit ()
    (interactive)
    ;; Copy all to a temp buffer and set to text mode.
    (let ((old-buffer (current-buffer)))
      (with-temp-buffer
	(insert-buffer-substring old-buffer)
	(text-mode)
	;; convert multiple correct answer and essay questions
	(beginning-of-buffer)
	(while (re-search-forward "^[:space:]*-" nil t)
	  (replace-match ""))
	;; Change correct multiple answer options to "*"
	(beginning-of-buffer)
	(let ((case-fold-search nil))
	  (while (re-search-forward "\[X\]" nil t)
	    (replace-match "*")))
	;; Mark short answer responses with "**"
	(beginning-of-buffer)
	(while (re-search-forward "+" nil t)
	  (replace-match "*"))
	;; remove whitespace at beginning of lines
	(beginning-of-buffer)
	(while (re-search-forward "^\s-*" nil t)
	  (replace-match ""))
	(beginning-of-buffer)
	(while (re-search-forward "\\(^[0-9]\\)" nil t)
	  (replace-match "\n\\1"))
	;; move correct answer symbol to beginning of line
	(beginning-of-buffer)
	(while (re-search-forward "\\(^.*\\)\\(\*$\\)" nil t)
	  (replace-match "\*\\1"))
	(delete-trailing-whitespace)
	;; delete empty line at end and beginning
	(end-of-buffer)
	(delete-char -1)
	(beginning-of-buffer)
	(kill-line)
	;; Copy result to clipboard
	(clipboard-kill-ring-save (point-min) (point-max))
	)
      )
    (browse-url "https://www.nyit.edu/its/canvas_exam_converter")
    )
#+end_src

Create attendance sheet.

#+begin_src emacs-lisp
(defun create-roll-sheet ()
  (interactive)
  ;; Append signature cells to each line.
  (goto-char (point-min))
  (replace-regexp "$" " |  | ")
  ;; kill bottom half of buffer and move to top
  (setq lines (count-lines (point-min) (point-max)))
  (setq lines (+ lines (% lines 2) ))
  (setq midpoint (+ (/ lines 2) 1))
  (goto-line midpoint)
  (kill-region (point) (point-max))
  (beginning-of-buffer)
  ;; Append each line from kill-ring to remaining lines.
  (dolist (cur-line-to-insert (split-string (current-kill 0) "\n"))
    (if (eobp)
	(newline)
      (move-end-of-line nil))
    (insert cur-line-to-insert)
    (forward-line))
  ;; Prepend pipe character to each line and kill last line.
  (goto-char (point-min))
  (replace-regexp "^" "| ")
  (kill-whole-line)
  ;; insert LaTeX table format and header lines
  (goto-char (point-min))
  (insert "#+ATTR_LATEX: :environment tblr :align hline{3-Z}={solid},row{2-Z}={f,10mm},colspec={XXXX}\n| *Name*              | *Signature* | *Name*              | *Signature* | \n")
  ;; Clean up table.
  (org-ctrl-c-ctrl-c)
  ;; Insert LaTeX header.
  (goto-char (point-min))
  (yas-expand-snippet (yas-lookup-snippet "roll-sheet")))
#+end_src

