config.org
** Copy Org Rich Text

From [[https://kitchingroup.cheme.cmu.edu/blog/2016/06/16/Copy-formatted-org-mode-text-from-Emacs-to-other-applications/][Copy formatted org-mode text from Emacs to other applications]]

#+begin_src emacs-lisp
  (defun formatted-copy ()
    "Export region to HTML, and copy it to the clipboard."
    (interactive)
    (save-window-excursion
      (let* ((buf (org-export-to-buffer 'html "*Formatted Copy*" nil nil t t))
	     (html (with-current-buffer buf (buffer-string))))
	(with-current-buffer buf
	  (shell-command-on-region
	   (point-min)
	   (point-max)
	   "textutil -stdin -format html -convert rtf -stdout | pbcopy"))
	(kill-buffer buf))))

  ;; (global-set-key (kbd "H-w") 'formatted-copy)
#+end_src

** Org Mode Hydra

#+begin_src emacs-lisp
   (major-mode-hydra-define org-mode
     (:quit-key "q")
     ("Export"
      (
       ("m" rlr/org-mklua "Make PDF with LuaLaTeX")
       ("p" rlr/org-mkpdf "Make PDF with PDFLaTeX")
       ("o" rlr/org-open-pdf "View PDF")
       ("h" make-html "HTML")
       ("el" org-latex-export-to-latex "Org to LaTeX")
       ("eb" org-beamer-export-to-pdf "Org to Beamer-PDF")
       ("eB" org-beamer-export-to-latex "Org to Beamer-LaTeX")
       ("s" lecture-slides "Lecture slides")
       ("n" lecture-notes "Lecture notes")
       ("ep" present "Present slides")
       ("ec" canvas-copy "Copy HTML for Canvas")
       ("es" canvas-notes "HTML Canvas notes")
       ("eS" make-syllabus "Syllabus")
       ("eh" make-handout "Handout")
       ("c" tex-clean "clean aux")
       ("C" tex-clean-all "clean all"))
      "Edit"
      (("dd" org-deadline "deadline")
       ("ds" org-schedule "schedule")
       ("r" org-refile "refile")
       ("du" rlr/org-date "update date stamp")
       ;; ("fn" org-footnote-new "insert footnote")
       ("ff" org-footnote-action "edit footnote")
       ("fc" citar-insert-citation "citation")
       ("il" org-mac-link-safari-insert-frontmost-url "insert safari link")
       ("s" org-insert-structure-template "insert structure block")
       ("w" csm/org-word-count "word count")
       ("y" yankpad-set-category "set yankpad"))
      "View"
      (("va" org-appear-mode :toggle t)
       ("vl" org-toggle-link-display :toggle t)
       ("vv" visible-mode :toggle t)
       ("vi" consult-org-heading "iMenu")
       ("vu" org-toggle-pretty-entities "org-pretty")
       ("vI" org-toggle-inline-images "Inline images"))
      "Blog"
      (("bn" rlrt-new-post "New draft")
       ("bt" orgblog-add-tag "Add tag")
       ("bi" orgblog-insert-image "Insert image")
       ("bp" orgblog-publish-draft "Publish draft")
       ("bb" orgblog-build "Build site")
       ("bs" orgblog-serve "Serve site")
       ("bd" orgblog-push "Push to Github"))
      "Notes"
      (("1" denote-link "link to note"))))
      #+end_src


* LaTeX

#+begin_src emacs-lisp
  (use-package tex
    :ensure auctex
    :init
    (setq TeX-parse-self t
	  TeX-auto-save t
	  TeX-electric-math nil
	  LaTeX-electric-left-right-brace nil
	  TeX-electric-sub-and-superscript nil
	  LaTeX-item-indent 0
	  TeX-quote-after-quote nil
	  TeX-clean-confirm nil
	  TeX-source-correlate-mode t
	  TeX-source-correlate-method 'synctex
	  TeX-view-program-selection '((output-pdf "PDF Viewer"))
	  TeX-view-program-list
	  '(("PDF Viewer" "/Applications/Skim.app/Contents/SharedSupport/displayline -b -g %n %o %b"))))
#+end_src

** LaTeX Build Functions

#+begin_src emacs-lisp
  (defun raise-emacs-on-aqua()
    (shell-command "osascript -e 'tell application \"Emacs\" to activate' "))
  (add-hook 'server-switch-hook 'raise-emacs-on-aqua)
  (defun tex-clean ()
    (interactive)
    (shell-command "latexmk -c"))

  (defun tex-clean-all ()
    (interactive)
    (shell-command "latexmk -C"))

  (defun arara-all ()
    (interactive)
    (async-shell-command "mkall"))

  (defun rlr/tex-mkpdf ()
    "Compile with pdf latexmk."
    (interactive)
    (save-buffer)
    (async-shell-command-no-window (concat "mkp " (shell-quote-argument(file-name-nondirectory buffer-file-name))))
    (TeX-view))

  (defun rlr/tex-mktc ()
    "Compile continuously with pdf latexmk."
    (interactive)
    (async-shell-command-no-window (concat "mkpc " (shell-quote-argument(file-name-nondirectory buffer-file-name)))))

  (defun rlr/tex-mklua ()
    "Compile with lua latexmk."
    (interactive)
    (save-buffer)
    (async-shell-command-no-window (concat "mkl " (shell-quote-argument(file-name-nondirectory buffer-file-name))))
    (TeX-view))

  (defun rlr/tex-mkluac ()
    "Compile continuously with lua latexmk."
    (interactive)
    (async-shell-command-no-window (concat "mklc " (shell-quote-argument(file-name-nondirectory buffer-file-name)))))

  (defun latex-word-count ()
    (interactive)
    (let* ((this-file (buffer-file-name))
	   (word-count
	    (with-output-to-string
	      (with-current-buffer standard-output
		(call-process "texcount" nil t nil "-brief" this-file)))))
      (string-match "\n$" word-count)
      (message (replace-match "" nil nil word-count))))
#+end_src



