init.el

(defalias 'mcq-item
   (kmacro "C-a C-k \\ c h o i c e SPC { C-y <down>"))

(defun mcq-wrap-line ()
  "Wrap the current line in \choice{}"
  (interactive)
  (beginning-of-line)
  (skip-chars-forward " \t")
  (insert "\\choice{")
  (end-of-line)
  (insert "}"))

(defun mcq-wrap-selection ()
  "Wrap the selected text in \choice{}"
  (interactive)
  (if (use-region-p)
      (let ((begin (region-beginning))
	    (end (region-end)))
	(save-excursion
	  (goto-char end)
	  (insert "}")
	  (goto-char begin)
	  (insert "\\choice{")))
    (insert "\\choice{}")
    (backward-char)))

(defun convert-quiz-claude-to-org ()
"Convert markdown-style quiz questions from Claude to Org mode format. Operates on the current buffer or active region."
  (interactive)
  (let ((start (if (use-region-p) (region-beginning) (point-min)))
	(end   (if (use-region-p) (region-end)       (point-max)))
	(question-num 0))
    (save-excursion
      ;; Remove '---' separator lines
      (goto-char start)
      (while (re-search-forward "^---\n?" end t)
	(replace-match ""))

      ;; Convert **Question N:** to "N."
      (goto-char start)
      (while (re-search-forward "^\\*\\*Question [0-9]+:\\*\\* " end t)
	(setq question-num (1+ question-num))
	(replace-match (format "%d. " question-num)))

      ;; Convert "- A)" "- B)" etc. to "     a)" "     b)" etc.
      (goto-char start)
      (while (re-search-forward "^- \\([A-D]\\))" end t)
	(replace-match (format "     %s)" (downcase (match-string 1)))))

      ;; Remove blank lines
      (goto-char start)
      (while (re-search-forward "^[[:blank:]]*\n" end t)
	(replace-match "")))))

(defun rlr/org-mc-to-latex-questions (beg end)
  "Convert org-mode multiple choice questions in region to LaTeX format. Questions are numbered lines followed by lettered choices (a-z). Correct answers are marked with * after the choice text."
  (interactive "r")
  (let* ((text (buffer-substring-no-properties beg end))
	   (lines (split-string text "\n"))
	   (result '())
	   (in-question nil))
    (dolist (line lines)
	(cond
	 ;; Numbered question line: "2. Question text"
	 ((string-match "^[[:space:]]*[0-9]+\\.[[:space:]]+\\(.+\\)$" line)
	  (when in-question
	    (push "  \\end{question}" result)
	(push "" result))
	  (push "  \\begin{question}" result)
	  (push (format "    %s" (match-string 1 line)) result)
	  (setq in-question t))
	 ;; Choice line: "  a) Choice text" or "  a) Choice text*"
	 ((string-match "^[[:space:]]*[a-z])[[:space:]]+\\(.+?\\)\\(*\\)?[[:space:]]*$" line)
	  (let* ((text (match-string 1 line))
		 (correct (match-string 2 line))
		 (tag (if correct "\\choice[!]" "\\choice")))
	    (push (format "    %s {%s}" tag text) result)))))
    (when in-question
	(push "  \\end{question}" result))
    (let ((output (mapconcat #'identity (nreverse result) "\n")))
	(goto-char beg)
	(delete-region beg end)
	(insert output))))

(defun rlr/copy-mcq-to-scratch ()
  "Copy the multiple choice question at point to the *scratch* buffer."
  (interactive)
  (save-excursion
    (let* ((question-start
	    (progn
	      (end-of-line)
	      (if (re-search-backward "^[0-9]+\\." nil t)
		  (point)
		(error "No question found at point"))))
	   (question-end
	    (progn
	      (goto-char question-start)
	      (forward-line 1)
	      (if (re-search-forward "^[0-9]+\\." nil t)
		  (match-beginning 0)
		(point-max))))
	   (text (buffer-substring-no-properties question-start question-end)))
      (with-current-buffer (get-buffer-create "*scratch*")
	(goto-char (point-max))
	(insert text)))))

(defun rlr/delete-mcq-at-point ()
  "Delete the multiple choice question at point, including all its choices."
  (interactive)
  (save-excursion
    (beginning-of-line)
    ;; If on a choice line, move up to the question line first
    (unless (looking-at "[[:space:]]*[0-9]+\\.")
	(re-search-backward "^[[:space:]]*[0-9]+\\." nil t))
    (let ((start (line-beginning-position))
	    (end (progn
		   (forward-line 1)
		   (if (re-search-forward "^[[:space:]]*[0-9]+\\." nil t)
		       (match-beginning 0)
		     (point-max)))))
	(kill-region start end)))
  (org-list-repair))

(defun reload-user-init-file()
  (interactive)
  (load-file user-init-file))

(defun rlr/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
	     (format "%.2f seconds"
		     (float-time
		(time-subtract after-init-time before-init-time)))
	     gcs-done))

(add-hook 'emacs-startup-hook #'rlr/display-startup-time)

(setq default-directory "~/")

;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; End:
